app/controllers/customers_controller.rb

def index
  @customers = Customer.all
---
SELECT "customers".* FROM "customers" WHERE (firstname LIKE '%Asd%' OR secondname LIKE '%Asd%' OR email LIKE '%Asd%') ORDER BY created_at DESC

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("firstname", "secondname", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", ""], ["secondname", ""], ["email", "6"], ["created_at", "2018-05-08 15:20:59.488957"], ["updated_at", "2018-05-08 15:20:59.488957"]]

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "email" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["email", "jankowalski@wp.pl"], ["updated_at", "2018-05-08 21:38:17.225398"], ["id", 11]]

  def destroy
    @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 2]]