app/controllers/films_controller.rb

SELECT "films".* FROM "films" WHERE (title LIKE '%2012%' OR director LIKE '%2012%' OR release_year LIKE '%2012%' OR date LIKE '%2012%') ORDER BY created_at DESC
SELECT  "films".* FROM "films" WHERE (title LIKE '%z%') ORDER BY created_at DESC LIMIT ?  [["LIMIT", 11]]
---
def index
  @films = Film.all
  if params[:search]
    @films = Film.search(params[:search]).order("created_at DESC").page params[:page]

INSERT INTO "films" ("title", "director", "release_year", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Asada"], ["director", "Asadas"], ["release_year", 1990], ["created_at", "2018-11-19 15:16:03.754808"], ["updated_at", "2018-11-19 15:16:03.754808"], ["image", "persona-16.png"]]
---
  def create
    @film = Film.new(film_params)

    respond_to do |format|
      if @film.save

UPDATE "films" SET "release_year" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["release_year", 2016], ["updated_at", "2018-03-14 16:25:51.380863"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @film.update(film_params)

DELETE FROM "films" WHERE "films"."id" = ?  [["id", 41]]
---
  def destroy
    @film.destroy

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 40], ["LIMIT", 1]]
---
    def set_film
      @film = Film.friendly.find(params[:id])