app/controllers/screenings_controller.rb

  def index
    @screenings = Screening.all
---
SELECT "screenings".* FROM "screenings" WHERE (customer.email LIKE '%asdasd@wp.pl%' OR film.title LIKE '%asdasd@wp.pl%') ORDER BY created_at DESC

  def show
    @screening = Screening.find(params[:id]).decorate
---
SELECT  "screenings".* FROM "screenings" WHERE "screenings"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def new
    @screening = Screening.new
    @customers = Customer.all.order(:email)
    @films = Film.all.order(:title)
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."email" ASC
SELECT "films".* FROM "films" ORDER BY "films"."title" ASC

  def edit
    @customers = Customer.all.order(:email)
    @films = Film.all.order(:title)
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."email" ASC
SELECT "films".* FROM "films" ORDER BY "films"."title" ASC

  def create
    @screening = Screening.new(screening_params)
    @customers = Customer.all.order(:email)
    @films = Film.all.order(:title)

    respond_to do |format|
      if @screening.save
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."email" ASC
SELECT "films".* FROM "films" ORDER BY "films"."title" ASC
INSERT INTO "screenings" ("customer_id", "film_id", "screeningdate", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 11], ["film_id", 42], ["screeningdate", "2019-11-19 15:20:00"], ["price", 23.0], ["created_at", "2018-11-19 15:20:14.911702"], ["updated_at", "2018-11-19 15:20:14.911702"]]

  def update
    @customers = Customer.all.order(:email)
    @films = Film.all.order(:title)
    respond_to do |format|
      if @screening.update(screening_params)
---
UPDATE "screenings" SET "screeningdate" = ?, "updated_at" = ? WHERE "screenings"."id" = ?  [["screeningdate", "2014-05-08 21:32:00"], ["updated_at", "2018-05-08 21:33:06.844822"], ["id", 11]]

  def destroy
    @screening.destroy
---
DELETE FROM "screenings" WHERE "screenings"."id" = ?  [["id", 3]]

  def set_screening
    @screening = Screening.find(params[:id])
---
SELECT  "screenings".* FROM "screenings" WHERE "screenings"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]